/*
  Переменные в JS можно объявить через let/const/var;

  В JS динамическая типизация - это значит, что при объявлении переменной нам не нужно
  явно указывать тип данных (строка/число/массив и т.д.)
  JS сам поймет какой тип нужно присвоить переменной;
*/
let age = 19

console.log(age)

age = 20

console.log(age)


/*
  По ходу программы мы можем переопределить переменную;

  Вызвать переменную до её объявления (инициализации) не получится!!!
*/

/*
  Объявление переменной через var - очень плохая практика, особенность заключается в том,
  что к такой переменной можно обратиться до её инициализации, но при этом будет выводиться
  "undefined"
*/


/*
  До этого мы использовали "let" для объявление переменных, а сейчас "const".
  Различие в том, что при "const" мы не сможем изменять её значение.
  Как правило, значения переменных нам изменять не нужно, поэтому лучше использовать "const"
*/
const name = "Dmitry"

console.log(name)


/*
  Можно объявить несколько переменных с ключевыми словами let/var/const
  Но лучше так не делать ^-^
*/
const nickname = 'Kanst', city = 'Krasnoyarsk', street = 'Borisova'


/*
  В значении переменной можно указать значение другой переменной
*/
const girlfriend = 'Lera'
const wife = girlfriend

console.log(wife)


/*
  Нельзя задавать переменные с одним именем
*/


/*
  Строгий режим " 'use strict' " - штука, которая бьет тебя по рукам, если ты пишешь херню,
  которая работала в JS раньше.
  Например:
*/
year = 2025
console.log(year)
/*
  Вроде программа отработала без ошибок, но так быть не должно!! Для этого мы и включаем строгий
  режим
*/


/*
  В JS есть зарезервированные слова, которые нельзя использовать при объявлении переменных.
  Вот список слов: https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Lexical_grammar#%D0%BA%D0%BB%D1%8E%D1%87%D0%B5%D0%B2%D1%8B%D0%B5_%D1%81%D0%BB%D0%BE%D0%B2%D0%B0
*/


/*
 Правило объявления переменных:
 1. Можно писать как в латинице, так и в кириллице (не рекомедуется!);
 2. Можно использовать "$", "_";
 3. Можно использовать цифры (но в начале переменной нельзя!)

 Переменные как правило пишут в camelCase нотации (каждое слово, кроме первого, начинается с большой буквы)
 Можно и так "BASE_URL" (Обычно используют для констант)
*/