/*
  Вообщем, много расписывать не буду. alert() вызывает всплывающее окно в браузере.
  Но важно помнить, что он прервет действие кода до закрытие окна.
*/
// alert('1')
// console.log('2')
// alert('3')
// console.log('4')


/*
  prompt() - Всплывающее окно,  в котором можно ввести информацию. Второй параметр - значение по умолчанию.
  Введенные значения будут являться строкой!!!!
*/
// const userAge = prompt('Сколько тебе лет', 19)
// console.log(`Возраст:  ${userAge}`);


/*
  confirm() - Используется для подтверждения каких-либо действий
*/


/*
  switch(case) - Инструкции, которые выполнятся при определенном значении
  В каждом case в конце обязательно нужно писать break, иначе case выполнится, но при этом продолжит
  дальнейшее выполнение
*/
const age = 20
switch (age) {
  case 0: {
    console.log('Такого возраст быть не может')
    break
  }
  case 10: {
    console.log('Тебе 10')
    break
  }
  case 20: {
    console.log('Тебе 20')
    break
  }
  default: {
    console.log('Я не понимаю сколько тебе')
    break
  }
}