/*
  while (условие) - пока условие истинно цикл будет выполняться
*/
// let count = 0

// while (count < 10) {
//   console.log(count)
//   count++
// }


/*
  Если нам нужно, чтоб цикл всё равно выполнился хотя бы раз, то нам нужен
  do while
*/
// let count1 = 100

// do {
//   console.log(count1)
//   count1++
// } while (count1 < 10)
// цикл while очень опасен, ведь есть риск сделать бесконечный цикл из-за неверного условия


/*
  for - можем задать количество выполнений
  (Начальная точка; До куда выполняется цикл; Действие выполняемое на каждой итерации цикла)
*/
// for (let i = 0; i < 4; i++) {
//   alert(i)
// }


/*
  С помощью ключевого слова break мы можем прервать выполнение цикла
  С помощью ключевого слова continue мы можем перейти к следующей итерации цикла
*/