// Функция setTimeout - отложенное выполнение кода
// const timerID =  setTimeout(() => {
//   console.log('Через 3 секунды')
// }, 3000) // Функция выполнится через 3 секунды

// clearTimeout(timerID) // Очистка таймера, таймер не сработает



// Функция setInterval - регулярное выполнение кода
// const intervalID =  setInterval(() => {
//   console.log('Hello') // Раз в секунуду в браузере появляется сообщение 'Hello'
// }, 1000)

// setTimeout(() => {
//   clearInterval(intervalID) // Интервал будет работать всего 5 секунд
// }, 5000)

// clearInterval(intervalID) // Также отменяет выполнение



// Особенности setInterval
/*
  1. setInterval не гарантирует, что предыдущий вызов кода завершил свою работу
  2. У него не совсем нулевая задержка, она равна примерно 4 милисекундам
*/